exercises/exercise_08_Vertiefung.tex
% Created 2025-12-31 Mi 14:03
% Intended LaTeX compiler: xelatex
\documentclass[a4paper,14pt,ngerman]{scrartcl}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{polyglossia}
\usepackage{polyglossia}
\setmainlanguage[variant=german]{german}
\usepackage{polyglossia}
\setdefaultlanguage{german}
\PolyglossiaSetup{german}{shorthands=on}
\AtBeginDocument{\let\babelprovide\relax}
\AtBeginDocument{\let\shorthandon\relax}
\AtBeginDocument{\let\shorthandoff\relax}
\setmainfont{Gentium Book Basic}
\setsansfont{Latin Modern Sans}
\setmonofont{Latin Modern Mono}
\usepackage{fancyhdr}
\usepackage{graphicx}
\usepackage{amsmath,amssymb}
\usepackage{xcolor}
\usepackage{xurl}
\usepackage{listings}
\usepackage{setspace}
\setstretch{1.3}
\author{Elias}
\date{\today}
\title{Vertiefung in der Praxisphase}
\hypersetup{
 pdfauthor={Elias},
 pdftitle={Vertiefung in der Praxisphase},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.1 (Org mode 9.7.11)}, 
 pdflang={German}}
\begin{document}

\section{\textbf{Vertiefung in der Praxisphase}}
\label{sec:org090c0ed}
\subsection{\textbf{Turingmaschinen und Parser}}
\label{sec:org2f43142}
\subsubsection{\textbf{Aufgabe 1}}
\label{sec:org9395092}

In der Vorlesung wurde besprochen, wie eine 2-Band-Turingmaschine das
Wortproblem für die Sprache \[L=\{ww \mid w \in \{a,b\}^+\}\]
entscheidet. Da Mehrband-Turingmaschinen und Ein-Band-Turingmaschinen
gleich mächtig sind, muss dieses Problem auch von einer
Ein-Band-Turingmaschine entschieden werden können. Konstruieren Sie eine
solche Turingmaschine.
\subsubsection{\textbf{Vorbemerkungen zu Aufgabe 2}}
\label{sec:orgae12cfd}

Parser wurden in der Vorlesung nicht thematisiert. Erarbeiten Sie sich
die Inhalte des Papers \emph{LR(k)-Analyse für Pragmatiker} von Andreas
Kunert, welches unter\\
\url{https://amor.cms.hu-berlin.de/\~kunert/papers/lr-analyse/lr.pdf}\\
zur Verfügung steht. Sie sollten sich mindestens die Kapitel 1 bis 3
aneignen, um die folgenden Aufgabe lösen zu können.
\subsubsection{\textbf{Aufgabe 2}}
\label{sec:orgb49236e}

Die präfixfreie Variante der Sprache \(L\) der korrekt geklammerten
Ausdrücke \[L=\{(), (()), ((())), (()()), \ldots\}\] enthält alle Worte
\(x\) mit gleicher Anzahl öffnender und schließender Klammern, wobei für
jede echte Vorsilbe \(u\) (mit \(x=uy, y\neq\varepsilon\)) die Zahl der
öffnenden Klammern größer ist als die Zahl der schließenden Klammern.

\begin{enumerate}
\item Entwickeln Sie für \(L\) einen deterministischen PDA \(A\), der \(L\)
mittels leerem Keller akzeptiert. \emph{Hinweis:} Dafür ist nur ein
einziger Zustand erforderlich.

\item \emph{Berechnen} Sie aus dem PDA \(A\) eine Typ-2-Grammatik \(G\), die
\(L\) produziert.

\item Prüfen Sie, ob es sich bei \(G\) um eine \(LR(0)\)-Grammatik handelt.
Ermitteln Sie dazu den Zustandsübergangsgraph sowie die
Parse-Tabelle.
\end{enumerate}
\end{document}
